ElectronicCats/Arduino_Boards_Index/electroniccats/samd/boards.txt
# Generic SAMD11C14A (SOIC-14)
electroniccats_samd11c14.name= Electronic Cats Generic SAMD11C14A
electroniccats_samd11c14.vid.0=0x16D0
electroniccats_samd11c14.pid.0=0x0557
electroniccats_samd11c14.vid.1=0x16D0
electroniccats_samd11c14.pid.1=0x0856

electroniccats_samd11c14.build.mcu=cortex-m0plus
electroniccats_samd11c14.build.f_cpu=48000000L
electroniccats_samd11c14.build.usb_product="SAMD11C14A"
electroniccats_samd11c14.build.usb_manufacturer="Electronic Cats"
electroniccats_samd11c14.build.board=SAMD_ZERO
electroniccats_samd11c14.build.core=arduino11
electroniccats_samd11c14.build.variant=Generic_D11C14A
electroniccats_samd11c14.build.variant_system_lib=
electroniccats_samd11c14.build.vid=0x16D0

electroniccats_samd11c14.upload.protocol=sam-ba

electroniccats_samd11c14.bootloader.tool=arduino:openocd
electroniccats_samd11c14.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_samd11c14.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_samd11c14.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_samd11c14.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_samd11c14.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_samd11c14.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_samd11c14.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_samd11c14.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL

electroniccats_samd11c14.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags}
electroniccats_samd11c14.build.ldscript=flash_16KB.ld
electroniccats_samd11c14.build.openocdscript=openocd_scripts/SAMD11C14A.cfg

electroniccats_samd11c14.bootloader.file=zero/binaries/sam_ba_Generic_D11C14A_SAMD11C14A.bin
electroniccats_samd11c14.menu.bootloader.4kb=4KB_BOOTLOADER
electroniccats_samd11c14.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
electroniccats_samd11c14.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
electroniccats_samd11c14.menu.bootloader.4kb.upload.tool=bossac
electroniccats_samd11c14.menu.bootloader.4kb.upload.use_1200bps_touch=true
electroniccats_samd11c14.menu.bootloader.4kb.upload.wait_for_upload_port=true
electroniccats_samd11c14.menu.bootloader.4kb.upload.native_usb=true
electroniccats_samd11c14.menu.bootloader.4kb.upload.maximum_size=12288
electroniccats_samd11c14.menu.bootloader.0kb=NO_BOOTLOADER
electroniccats_samd11c14.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
electroniccats_samd11c14.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
electroniccats_samd11c14.menu.bootloader.0kb.upload.tool=bossac
electroniccats_samd11c14.menu.bootloader.0kb.upload.use_1200bps_touch=false
electroniccats_samd11c14.menu.bootloader.0kb.upload.wait_for_upload_port=false
electroniccats_samd11c14.menu.bootloader.0kb.upload.native_usb=false
electroniccats_samd11c14.menu.bootloader.0kb.upload.maximum_size=16384

electroniccats_samd11c14.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
electroniccats_samd11c14.menu.serial.one_uart.build.serialcom_uart=ONE_UART
electroniccats_samd11c14.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
electroniccats_samd11c14.menu.serial.one_uart.build.serialcom_spi=NO_SPI
electroniccats_samd11c14.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
electroniccats_samd11c14.menu.serial.two_uart.build.serialcom_uart=TWO_UART
electroniccats_samd11c14.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
electroniccats_samd11c14.menu.serial.two_uart.build.serialcom_spi=NO_SPI
electroniccats_samd11c14.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
electroniccats_samd11c14.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
electroniccats_samd11c14.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
electroniccats_samd11c14.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
electroniccats_samd11c14.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
electroniccats_samd11c14.menu.serial.no_uart.build.serialcom_uart=NO_UART
electroniccats_samd11c14.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
electroniccats_samd11c14.menu.serial.no_uart.build.serialcom_spi=ONE_SPI

electroniccats_samd11c14.menu.usb.cdc=CDC_ONLY
electroniccats_samd11c14.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_samd11c14.menu.usb.cdc.build.pid=0x0557
electroniccats_samd11c14.menu.usb.cdc_hid=CDC_HID
electroniccats_samd11c14.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_samd11c14.menu.usb.cdc_hid.build.pid=0x0856
electroniccats_samd11c14.menu.usb.withcdc=WITH_CDC
electroniccats_samd11c14.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_samd11c14.menu.usb.withcdc.build.pid=0x0B41
electroniccats_samd11c14.menu.usb.hid=HID_ONLY
electroniccats_samd11c14.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_samd11c14.menu.usb.hid.build.pid=0x0B40
electroniccats_samd11c14.menu.usb.nocdc=WITHOUT_CDC
electroniccats_samd11c14.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_samd11c14.menu.usb.nocdc.build.pid=0x0A0C
electroniccats_samd11c14.menu.usb.none=USB_DISABLED
electroniccats_samd11c14.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_samd11c14.menu.usb.none.build.pid=0x0856